# 4 - Абонентский справочник

## Задание
Написать программу абонентский справочник. Список абонентов
представляет собой статический массив (100 элементов) из структур
следующего в вида:

```bash
struct abonent {
char name[10];
char second_name[10];
char tel[10];
};
```
При запуске на экран выводится текстовое меню:
```bash
1) Добавить абонента
2) Удалить абонента
3) Поиск абонентов по имени
4) Вывод всех записей
5) Выход
```
и пользователю предлагается ввести пункт меню с клавиатуры. Добавление
абонента в массив реализуется простым заполнением свободной структуры,
при выходе за 100 абонентов уведомить пользователя о переполнении
справочника и не позволять больше добавлять абонентов. При удалении
структура заполняется нулями. При поиске пользователь вводит с клавиатуры
имя абонентов и на экран выводится список всех абонентов с таким же именем.
Программа продолжает выполняться пока пользователь не введет пункт 5.

## Структура проекта
```bash
├── Doxyfile        # Конфиг для генерации документации (doxygen)
├── include
│   ├── abonent.h   # Заголовочник справочника
│   └── utils.h     # Заголовочник утилит
├── Makefile
├── README.md
└── src
    ├── abonent.c   # Логика справочника абонетов
    ├── main.c      # Основной файл
    ├── menu.c      # Логика меню и взаимодействия с абонентами
    └── utils.c     # Утилиты
```

## Сборка и запуск
```bash
make                # сборка проекта
make run            # сборка и запуск проекта
make doc            # сборка документации
make clean          # очистка бинарника
make clean-doc      # очистка документации
```

## Проверка задания
> Добавление абонента в массив реализуется простым заполнением свободной структуры
abonent.c (16 - 24 строчки)
```bash
bool abonent_add(struct abonent data) {
    ...
    g_abonents[g_size] = data;
    g_size++;
    return 0;
}
```
Пример (Размер справочника: 2):
```bash
name[10]: Leo
second_name[10]: Gene
tel[10]: +4326367

 Абонент "leo" был добавлен [id: 0]
----Абонентский справочник [1 из 2]----
1) Добавить абонента 
2) Удалить абонента 
3) Поиск абонентов по имени 
4) Вывод всех записей 
5) Выход 

```

> при выходе за 100 абонентов уведомить пользователя о переполнении справочника и не позволять больше добавлять абонентов.
abonent.c (16 - 24 строчки)
```bash
bool abonent_add(struct abonent data) {
    if(g_size >= ABONENTS_SIZE){
        printf(" Ошибка \n справочник полон, удалите запись [%u из %u]\n", g_size, ABONENTS_SIZE);
        return 1;
    }
    ...
}
```

Пример (Размер справочника: 2):
```bash
 Ошибка 
 Cправочник полон [2 из 2], удалите запись
----Абонентский справочник [2 из 2]----
1) Добавить абонента 
2) Удалить абонента 
3) Поиск абонентов по имени 
4) Вывод всех записей 
5) Выход 

```

> При удалении структура заполняется нулями.
abonent.c (26 - 42 строчки)
```bash
bool abonent_remove(uint id) {
    ...
    g_abonents[g_size - 1] = (struct abonent){ 0 }; 
    g_size--;
    return 0;
}
```

Пример:
```bash
----Абонентский справочник [4 из 100]----
1) Добавить абонента 
2) Удалить абонента 
3) Поиск абонентов по имени 
4) Вывод всех записей 
5) Выход 
2
clear
Введите id абонента: 2
clear
 Абонент [id: 2] был удален
----Абонентский справочник [3 из 100]----
1) Добавить абонента 
2) Удалить абонента 
3) Поиск абонентов по имени 
4) Вывод всех записей 
5) Выход 

```

> При поиске пользователь вводит с клавиатуры имя абонентов и на экран выводится список всех абонентов с таким же именем.
abonent.c (44 - 55 строчки)
```bash
void abonent_find(char name[10]) {
    bool found = false;
    for(uint id = 0; id < g_size; id++) {
        if (!strcmp10(g_abonents[id].name, name)){ // strcmp10 -> utils.c
            abonent_print(id);
            found = true;
        }
    }
    if(!found){
        printf("Абонент \"%s\" не найден\n", name);
    }
}
```

Пример:
```bash
[0]      Абонент: alex telon 
         Tel: +43267
[1]      Абонент: alex gamer 
         Tel: +43245
[2]      Абонент: leno lon 
         Tel: +43256
----Абонентский справочник [3 из 100]----
1) Добавить абонента 
2) Удалить абонента 
3) Поиск абонентов по имени 
4) Вывод всех записей 
5) Выход 
3
clear
Введите имя абонента: alex
clear
[0]      Абонент: alex telon 
         Tel: +43267
[1]      Абонент: alex gamer 
         Tel: +43245
----Абонентский справочник [3 из 100]----
1) Добавить абонента 
2) Удалить абонента 
3) Поиск абонентов по имени 
4) Вывод всех записей 
5) Выход 

```

